In [1]:
# SQL ALchemy 
from sqlalchemy import create_engine

# Import PyMySQL
import pymysql
pymysql.install_as_MySQLdb()

# Config Variables 
from config import remote_db_endpoint, remote_db_port
from config import remote_gwsis_dbname, remote_gwsis_dbuser, remote_gwsis_dbpwd
from config import local_db_user, local_db_pwd, local_db_endpoint, local_db_port, local_db_name

# Import Pandas 
import pandas as pd

In [5]:
# Create engine and pass mySQL connnection 

# CSV Files
income_csv = "Resources/Annual_Avg_Pay.csv"
income_df = pd.read_csv(income_csv)

unemployment_csv = "Resources/unemployment_rate.csv"
unemployment_df = pd.read_csv(unemployment_csv)

education_csv = "Resources/education_cleaner.csv"
education_df = pd.read_csv(education_csv)

hiv_rates_csv = "Resources/New_HIV_Case_Rates.csv"
hiv_rates_df = pd.read_csv(hiv_rates_csv)

# Cloud MySQl database connection on AWS
engine = create_engine(f"mysql://{remote_gwsis_dbuser}:{remote_gwsis_dbpwd}@{remote_db_endpoint}:{remote_db_port}/{remote_gwsis_dbname}")

In [6]:
# Create remote database engine connection 
conn = engine.connect()

In [7]:
# Dataframe to SQL
income_df.to_sql(name='income_data', if_exists='append', con=conn, chunksize=500, index=False)

unemployment_df.to_sql(name='unemployment_data', if_exists='append', con=conn, chunksize=500, index=False)

education_df.to_sql(name='education_data', if_exists='append', con=conn, chunksize=500, index=False)

hiv_rates_df.to_sql(name='hiv_rates_data', if_exists='append', con=conn, chunksize=500, index=False)

In [8]:
remote_income_data = pd.read_sql("SELECT * FROM income_data", conn)
print(len(remote_income_data))
remote_income_data.head()

102

           Name  Annual_Avg_Pay_2008-2012  Annual_Avg_Pay_2013-2018
0     Alabama                     40324.2              44679.833333
1      Alaska                     48227.0              53787.666667
2     Arizona                     43764.6              48551.166667
3    Arkansas                     36474.2              41381.833333
4  California                     53627.0              62525.000000

In [9]:
remote_unemployment_data = pd.read_sql("SELECT * FROM unemployment_data", conn)
print(len(remote_unemployment_data))
remote_unemployment_data.head()

153

,Name,Unemployment_rate_2008,Unemployment_rate_2009,Unemployment_rate_2010,Unemployment_rate_2011,Unemployment_rate_2012,Unemployment_rate_2013,Unemployment_rate_2014,Unemployment_rate_2015,Unemployment_rate_2016,Unemployment_rate_2017,Unemployment_rate_2018
0,Alabama,5.7,11.0,10.5,9.6,8.0,7.2,6.8,6.1,5.8,4.4,3.9
1,Alaska,6.7,7.7,7.9,7.6,7.1,7.0,6.9,6.5,6.9,7.0,6.6
2,Arizona,6.2,9.9,10.4,9.5,8.3,7.7,6.8,6.1,5.4,4.9,4.8
3,Arkansas,5.5,7.8,8.2,8.3,7.6,7.2,6.0,5.0,4.0,3.7,3.7
4,California,7.3,11.2,12.2,11.7,10.4,8.9,7.5,6.2,5.5,4.8,4.2

In [10]:
remote_education_data = pd.read_sql("SELECT * FROM education_data", conn)
print(len(remote_education_data))
remote_education_data.head()

306

,Unnamed: 0,State,Area_name,2007-08,2008-09,2009-10,2010-11,2011-12,2012-13,2013-14,2014-15,2015-16,2016-17,2017-18,2018-19
0,7,AL,Alabama,41346.0,42082.0,43166.0,46035.0,45394.0,44233.0,44540.0,45420.0,45910.0,45490.0,45100.0,44400.0
1,8,AK,Alaska,7855.0,8008.0,8245.0,8064.0,7989.0,7860.0,7720.0,7860.0,7690.0,7930.0,7940.0,7880.0
2,9,AZ,Arizona,61667.0,62374.0,61145.0,64472.0,63208.0,62208.0,66700.0,67200.0,67290.0,68190.0,66760.0,67240.0
3,10,AR,Arkansas,28725.0,28057.0,28276.0,28205.0,28419.0,28928.0,29610.0,30350.0,30610.0,30960.0,30970.0,31010.0
4,11,CA,California,374561.0,372310.0,404987.0,410467.0,418664.0,422125.0,424080.0,422830.0,424430.0,422200.0,426140.0,420520.0

In [11]:
remote_hiv_rates_data = pd.read_sql("SELECT * FROM hiv_rates_data", conn)
print(len(remote_hiv_rates_data))
remote_hiv_rates_data.head()

51

,Name,New HIV Case Rate 2008-2012,New HIV Case Rate 2013-2018,New HIV Case Rate Variance
0,Alabama,0.000144,0.000132,0.000012
1,Alaska,0.000041,0.000040,0.000002
2,Arizona,0.000098,0.000106,-0.000008
3,Arkansas,0.000085,0.000096,-0.000011
4,California,0.000142,0.000125,0.000017